{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[BOS]": 2,
      "[EOS]": 3,
      "\n": 4,
      " ": 5,
      "!": 6,
      "$": 7,
      "&": 8,
      "'": 9,
      ",": 10,
      "-": 11,
      ".": 12,
      "3": 13,
      ":": 14,
      ";": 15,
      "?": 16,
      "A": 17,
      "B": 18,
      "C": 19,
      "D": 20,
      "E": 21,
      "F": 22,
      "G": 23,
      "H": 24,
      "I": 25,
      "J": 26,
      "K": 27,
      "L": 28,
      "M": 29,
      "N": 30,
      "O": 31,
      "P": 32,
      "Q": 33,
      "R": 34,
      "S": 35,
      "T": 36,
      "U": 37,
      "V": 38,
      "W": 39,
      "X": 40,
      "Y": 41,
      "Z": 42,
      "a": 43,
      "b": 44,
      "c": 45,
      "d": 46,
      "e": 47,
      "f": 48,
      "g": 49,
      "h": 50,
      "i": 51,
      "j": 52,
      "k": 53,
      "l": 54,
      "m": 55,
      "n": 56,
      "o": 57,
      "p": 58,
      "q": 59,
      "r": 60,
      "s": 61,
      "t": 62,
      "u": 63,
      "v": 64,
      "w": 65,
      "x": 66,
      "y": 67,
      "z": 68,
      "e ": 69,
      "th": 70,
      "t ": 71,
      "s ": 72,
      "d ": 73,
      ", ": 74,
      "ou": 75,
      "er": 76,
      "in": 77,
      "y ": 78,
      "an": 79,
      ":\n": 80,
      "or": 81,
      "o ": 82,
      "en": 83,
      "ar": 84,
      ".\n": 85,
      " th": 86,
      "on": 87,
      "ll": 88,
      "ha": 89,
      ",\n": 90,
      "is ": 91,
      "es": 92,
      "you": 93,
      " s": 94,
      "to ": 95,
      "and ": 96,
      "ow": 97,
      "ea": 98,
      " m": 99,
      " w": 100,
      "of": 101,
      " h": 102,
      "ing": 103,
      "om": 104,
      " a": 105,
      "ch": 106,
      "the ": 107,
      "st": 108,
      " b": 109,
      "no": 110,
      "ir": 111,
      "for": 112,
      "ve ": 113,
      "e, ": 114,
      "ith": 115,
      " the ": 116,
      "se": 117,
      "li": 118,
      "Th": 119,
      "ll ": 120,
      "re": 121,
      "st ": 122,
      "at ": 123,
      "An": 124,
      "I ": 125,
      "ear": 126,
      "im": 127,
      "it": 128,
      "oo": 129,
      "gh": 130,
      "at": 131,
      "is": 132,
      "le": 133,
      "er ": 134,
      "?\n": 135,
      "our": 136,
      "And ": 137,
      "'s ": 138,
      "ee": 139,
      "not ": 140,
      "my ": 141,
      ";\n": 142,
      "ra": 143,
      "your": 144,
      "ur": 145,
      "hat ": 146,
      "ri": 147,
      "ut ": 148,
      "ld ": 149,
      "O:\n": 150,
      "of ": 151,
      "ed ": 152,
      "la": 153,
      "it ": 154,
      "ro": 155,
      "ere ": 156,
      "es ": 157,
      "d, ": 158,
      "un": 159,
      "EN": 160,
      "ke ": 161,
      "y, ": 162,
      "IN": 163,
      " d": 164,
      "as ": 165,
      "fa": 166,
      "with": 167,
      "have ": 168,
      "S:\n": 169,
      "!\n": 170,
      " c": 171,
      "Wh": 172,
      "that ": 173,
      "ent": 174,
      "the": 175,
      "ce": 176,
      "sh": 177,
      "ma": 178,
      " p": 179,
      "ther": 180,
      "be": 181,
      ". ": 182,
      "AR": 183,
      "ce ": 184,
      "ing ": 185,
      "al": 186,
      "; ": 187,
      "thou": 188,
      "s, ": 189,
      "me ": 190,
      "se ": 191,
      "lo": 192,
      "ck": 193,
      "wh": 194,
      "il": 195,
      "'d ": 196,
      "IO:\n": 197,
      "now": 198,
      "ill": 199
    },
    "merges": [
      [
        "e",
        " "
      ],
      [
        "t",
        "h"
      ],
      [
        "t",
        " "
      ],
      [
        "s",
        " "
      ],
      [
        "d",
        " "
      ],
      [
        ",",
        " "
      ],
      [
        "o",
        "u"
      ],
      [
        "e",
        "r"
      ],
      [
        "i",
        "n"
      ],
      [
        "y",
        " "
      ],
      [
        "a",
        "n"
      ],
      [
        ":",
        "\n"
      ],
      [
        "o",
        "r"
      ],
      [
        "o",
        " "
      ],
      [
        "e",
        "n"
      ],
      [
        "a",
        "r"
      ],
      [
        ".",
        "\n"
      ],
      [
        " ",
        "th"
      ],
      [
        "o",
        "n"
      ],
      [
        "l",
        "l"
      ],
      [
        "h",
        "a"
      ],
      [
        ",",
        "\n"
      ],
      [
        "i",
        "s "
      ],
      [
        "e",
        "s"
      ],
      [
        "y",
        "ou"
      ],
      [
        " ",
        "s"
      ],
      [
        "t",
        "o "
      ],
      [
        "an",
        "d "
      ],
      [
        "o",
        "w"
      ],
      [
        "e",
        "a"
      ],
      [
        " ",
        "m"
      ],
      [
        " ",
        "w"
      ],
      [
        "o",
        "f"
      ],
      [
        " ",
        "h"
      ],
      [
        "in",
        "g"
      ],
      [
        "o",
        "m"
      ],
      [
        " ",
        "a"
      ],
      [
        "c",
        "h"
      ],
      [
        "th",
        "e "
      ],
      [
        "s",
        "t"
      ],
      [
        " ",
        "b"
      ],
      [
        "n",
        "o"
      ],
      [
        "i",
        "r"
      ],
      [
        "f",
        "or"
      ],
      [
        "v",
        "e "
      ],
      [
        "e",
        ", "
      ],
      [
        "i",
        "th"
      ],
      [
        " th",
        "e "
      ],
      [
        "s",
        "e"
      ],
      [
        "l",
        "i"
      ],
      [
        "T",
        "h"
      ],
      [
        "ll",
        " "
      ],
      [
        "r",
        "e"
      ],
      [
        "s",
        "t "
      ],
      [
        "a",
        "t "
      ],
      [
        "A",
        "n"
      ],
      [
        "I",
        " "
      ],
      [
        "e",
        "ar"
      ],
      [
        "i",
        "m"
      ],
      [
        "i",
        "t"
      ],
      [
        "o",
        "o"
      ],
      [
        "g",
        "h"
      ],
      [
        "a",
        "t"
      ],
      [
        "i",
        "s"
      ],
      [
        "l",
        "e"
      ],
      [
        "er",
        " "
      ],
      [
        "?",
        "\n"
      ],
      [
        "ou",
        "r"
      ],
      [
        "An",
        "d "
      ],
      [
        "'",
        "s "
      ],
      [
        "e",
        "e"
      ],
      [
        "no",
        "t "
      ],
      [
        "m",
        "y "
      ],
      [
        ";",
        "\n"
      ],
      [
        "r",
        "a"
      ],
      [
        "you",
        "r"
      ],
      [
        "u",
        "r"
      ],
      [
        "ha",
        "t "
      ],
      [
        "r",
        "i"
      ],
      [
        "u",
        "t "
      ],
      [
        "l",
        "d "
      ],
      [
        "O",
        ":\n"
      ],
      [
        "of",
        " "
      ],
      [
        "e",
        "d "
      ],
      [
        "l",
        "a"
      ],
      [
        "i",
        "t "
      ],
      [
        "r",
        "o"
      ],
      [
        "er",
        "e "
      ],
      [
        "e",
        "s "
      ],
      [
        "d",
        ", "
      ],
      [
        "u",
        "n"
      ],
      [
        "E",
        "N"
      ],
      [
        "k",
        "e "
      ],
      [
        "y",
        ", "
      ],
      [
        "I",
        "N"
      ],
      [
        " ",
        "d"
      ],
      [
        "a",
        "s "
      ],
      [
        "f",
        "a"
      ],
      [
        "w",
        "ith"
      ],
      [
        "ha",
        "ve "
      ],
      [
        "S",
        ":\n"
      ],
      [
        "!",
        "\n"
      ],
      [
        " ",
        "c"
      ],
      [
        "W",
        "h"
      ],
      [
        "th",
        "at "
      ],
      [
        "en",
        "t"
      ],
      [
        "th",
        "e"
      ],
      [
        "c",
        "e"
      ],
      [
        "s",
        "h"
      ],
      [
        "m",
        "a"
      ],
      [
        " ",
        "p"
      ],
      [
        "th",
        "er"
      ],
      [
        "b",
        "e"
      ],
      [
        ".",
        " "
      ],
      [
        "A",
        "R"
      ],
      [
        "c",
        "e "
      ],
      [
        "ing",
        " "
      ],
      [
        "a",
        "l"
      ],
      [
        ";",
        " "
      ],
      [
        "th",
        "ou"
      ],
      [
        "s",
        ", "
      ],
      [
        "m",
        "e "
      ],
      [
        "s",
        "e "
      ],
      [
        "l",
        "o"
      ],
      [
        "c",
        "k"
      ],
      [
        "w",
        "h"
      ],
      [
        "i",
        "l"
      ],
      [
        "'",
        "d "
      ],
      [
        "I",
        "O:\n"
      ],
      [
        "n",
        "ow"
      ],
      [
        "i",
        "ll"
      ]
    ]
  }
}